* Hello, World!

** C

#+begin_src C :results output
#include <stdio.h>

int main() {
    printf("Hello, World!\n");
    return 0;
}
#+end_src

#+RESULTS:
: Hello, World!



** C#


#+BEGIN_SRC csharp :results output :framework "net10.0"
System.Console.WriteLine("Hello, Charm!");
#+end_src

#+RESULTS:
: Hello, Charm!



** Crystal

#+begin_src crystal :results output
puts "Hello, World!"
#+end_src

#+RESULTS:
: Hello, World!

** C++

#+begin_src cpp :results output
#include <iostream>

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
#+end_src

#+RESULTS:
: Hello, World!

** D

#+begin_src d :results output
import std.stdio;

void main() {
    writeln("Hello, World!");
}
#+end_src

#+RESULTS:



** Emacs Lisp

#+begin_src emacs-lisp :results output
(print "Hello, World!")
#+end_src

#+RESULTS:
: 
: "Hello, World!"

** Fortran

#+begin_src fortran :results output
program hello
    print *, "Hello, World!"
end program hello
#+end_src

#+RESULTS:
: Hello, World!

** Go

#+begin_src go :results output
package main

import "fmt"

func main() {
  fmt.Println("Hello, World!")
}
#+end_src

#+RESULTS:
: Hello, World!

** Guile

#+begin_src scheme :results output
(display "Hello, World!")
#+end_src

#+RESULTS:
: Hello, World!

** JavaScript
#+begin_src js :results output
console.log("Hello, World!");
#+end_src

#+RESULTS:
: Hello, World!

** Lua

#+begin_src lua :results output
print("Hello, World!")
#+end_src

#+RESULTS:
: Hello, World!




** OCaml

#+begin_src ocaml :results output
print_endline "Hello, World!";;
#+end_src

#+RESULTS:
: Hello, World!


** Perl

#+begin_src perl :results output
print "Hello, World!\n";
#+end_src

#+RESULTS:
: Hello, World!

** PHP

#+begin_src php :results output
<?php
echo "Hello, World!";
?>
#+end_src

#+RESULTS:
: Hello, World!

** Python

#+begin_src python :results output
print("Hello, World!")
#+end_src

#+RESULTS:
: Hello, World!

** R

#+begin_src R :results output
print("Hello, World!")
#+end_src

#+RESULTS:
: [1] "Hello, World!"

** Ruby

#+begin_src ruby :results output
puts "Hello, World!"
#+end_src

#+RESULTS:
: Hello, World!
** Rust

#+begin_src rust :results output
fn main() {
  println!("Hello, World!");
}
#+end_src

#+RESULTS:
: Hello, World!

** Tcl

#+begin_src tcl :results output
puts "Hello, World!"
#+end_src

#+RESULTS:
: Hello, World!


** Shell

#+begin_src sh :results output
echo "Hello, World!"
#+end_src

#+RESULTS:
: Hello, World!

